23250/examples/4.xml

 <!-- Клиент пополняет счет в рублях долларами. 
 Валютная пара у нас USDRUB. USD – базовая (currency1), RUB – котируемая (currency2). 
 В этом случае банк покупает у клиента доллары за рубли и мы выбираем курс bid. -->

 <soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:jour="http://journal.ws.spectrum" xmlns:xsd="http://model.ws.spectrum/xsd">
   <soap:Header/>
   <soap:Body>
      <jour:create>
         <jour:request>
            <xsd:operationEntity>
               <xsd:client>
                  <xsd:clientTypeEnum>0</xsd:clientTypeEnum>
                  <xsd:clientExtId>****-**-siebel</xsd:clientExtId>
                  <xsd:clientIdSys>SBL_FR</xsd:clientIdSys>
                  <xsd:icIssueAutority>*** ОВД Т******* р***** г***** М***** кп 7**-1**</xsd:icIssueAutority>
                  <xsd:icIssueDate>2***-**-**</xsd:icIssueDate>
                  <xsd:icNum>7*****</xsd:icNum>
                  <xsd:icSeries>6***</xsd:icSeries>
                  <xsd:identityCardTypeId>2*</xsd:identityCardTypeId>
                  <xsd:personFirstName>А*****</xsd:personFirstName>
                  <xsd:personPatronymic>Ю*******</xsd:personPatronymic>
                  <xsd:personSurname>З*******</xsd:personSurname>
                  <xsd:personCitizenCountryCode>643</xsd:personCitizenCountryCode>
                  <!-- <xsd:personCitizenCountryCode>643</xsd:personCitizenCountryCode>-->
               </xsd:client>
               <xsd:deptCode>1126</xsd:deptCode>
               <xsd:extFee>
                  <xsd:currency>RUB</xsd:currency>
                  <xsd:summa>77</xsd:summa>
               </xsd:extFee>
               <xsd:documents>
                  <xsd:analyticAttributes>
                     <xsd:code>CBO_CODE</xsd:code>
                     <xsd:value>711210-00</xsd:value>
                  </xsd:analyticAttributes>
                 <!-- <xsd:cashSymbols>
                     <xsd:cashSymbolCode>16</xsd:cashSymbolCode>
                     <xsd:summa>
                        <xsd:currency>RUB</xsd:currency>
                        <xsd:summa>20020.50</xsd:summa>
                     </xsd:summa>
                  </xsd:cashSymbols>-->
                  <xsd:creditSumma>
                     <xsd:currency>RUB</xsd:currency>
                     <xsd:summa>20020.50</xsd:summa>
                  </xsd:creditSumma>
                  <xsd:creditAccountEntity>
                     <xsd:accountIdSys>99995</xsd:accountIdSys>
                     <xsd:accountNum>40817840************</xsd:accountNum>
                     <xsd:deptCode>1126</xsd:deptCode>
                  </xsd:creditAccountEntity>
                  <xsd:debitSumma>
                     <xsd:currency>USD</xsd:currency>
                     <xsd:summa>270</xsd:summa>
                  </xsd:debitSumma>
                  <xsd:description>Внесение наличных на банковский счет 
                     На основании: договор No 40817840************</xsd:description>
                  <xsd:docNumber>12345677</xsd:docNumber>
               </xsd:documents>
               <xsd:login>O1126</xsd:login>
               <xsd:idSys>99995</xsd:idSys>
               <xsd:operJournalExtId>SP.CONP.1555566034</xsd:operJournalExtId>
               <xsd:operationCode>1060</xsd:operationCode>
               <xsd:operationRegDate>2022-04-25T10:00:00</xsd:operationRegDate>
            </xsd:operationEntity>
            <xsd:requestInfo>
               <xsd:messageId>158810113</xsd:messageId>
            </xsd:requestInfo>
         </jour:request>
      </jour:create>
   </soap:Body>
</soap:Envelope>